# NameKey Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionRectangular..::..NameKey Property
StructuralSectionRectangular Class See Also
---
Name Key
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string NameKey { get; set; }
```

Visual Basic
---
```text
Public Property NameKey As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ NameKey {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace